$(function () {

    //ul列表
    var ul_arr = ["用友T3标准版", "用友T6产品线", "U890", "用友表单"];
    var ul2 = "";
    for (var i = 0; i < ul_arr.length; i++) {
        ul2 += '<a href="court_travel.html?add=' + i + '">' + ul_arr[i] + '</a>';
    }
    $(ul2).appendTo("#top_qie");


    var shuju1 = [
        {
            "title": "代理产品简介",
            "name": "T3",
            "content": "支持成长型中小企业快速应对日益激烈的市场竞争，以客户为核心，集产、供、销、财一体解决方案，实现内部业务流程畅通、智能化管控平台、立体综合统计分析，支持全面科学决策；用友通精算版还为企业财务人员搭建应用、学习、职业发展的个性化关怀门户。",
            "content_ul": [],
            "image": "./img/t3_1.jpg",
            "main": ""
        },
        {
            "title": "应用价值",
            "name": "T3",
            "content": "",
            "content_ul": [
                "财务监控：规范、精细，提升效率和管理",
                "业务监控：挖掘利润、优化业务流程",
                "库存监控：理清库存 加强动态管控",
                "往来业务监控：降低风险，加快资金回流",
                "生产监控：以销定产 降低成本",
                "支持2013《小企业会计准则》及营改增政策：预置符合政策的会计科目及报表模板、常用科目、常用凭证",
                "保障投资：高性价比购置，全线产品平滑升级"
            ],
            "image": "./img/t3_2.jpg",
            "main": ""
        },
        
        {
            "title": "功能介绍",
            "name": "T3",
            "content": "",
            "content_ul": [
                "系统管理：包括细致的权限设置、方便的多账套复制及综合查询、分析，个性化财务人员门户中心",
                "总账：企业财务人员借助总账系统可以实现日常财务工作的无纸化办公。凭证录入、审核、登记账簿（包括：总分类账、明细账、日记账等）、结账等都由系统协助您轻松完成；财务报表与总账、业务系统之间有完善的接口，可以自定义设置取数，及时、准确地出具企业资产负债表、利润表、现金流量表等标准或个性化财务报表，为企业领导者进行重大决策提供数据依据。",
                "工资管理：包括工资录入、工资计算、所得税计提、银行代发、工资分摊处理等，更好的管理人员档案，建立员工工资台账，为各种基金的提取和上缴管理提供依据。",
                "固定资产：提供固定资产卡片管理、资产增减变动、转移、折旧计提、折旧分配等一系列管理办法，以保证资产的完整和正常使用，提高资产利用率。",
            ],
            "image": "./img/t3_3.jpg",
            "main": ""
        },
        {
            "title": "供应链管理",
            "name": "T3",
            "content": "",
            "content_ul": [
                "采购：按销售订货及库存情况定时定量采购、成本处理和应付款核销，包括订单管理、到货入库、开票结算、付款等，统计分析报表及时准确。",
                "销售：关注客户资料、价格政策、信用、应收款回流等关键业务点的管理与控制，提供多角度货、票、款统计分析。",
                "库存：强大的库存业务、状态控制、分析等功能，有效地跟踪出入库、分析异常状态，反应价值分布，提供库存的短缺、超储、安全等预警机制动态信息。",
                "核算：主要针对企业商品收发存业务运行核算，掌握商品成本情况，为企业成本核算提供基础数据，并可动态反映库存资金的增减变动，减少资金积压，加速资金周转提供决策依据。",
            ],
            "image": "./img/t3_4.jpg",
            "main": ""
        },
        {
            "title": "财务分析、老板通、产加工",
            "name": "T3",
            "content": "",
            "content_ul": [
                "财务分析：企业决微的重要组成部分，通过系统的财务分析对会计数据再加工，为决策者提供及时、准确、客观的决策依据，从而避免决微的主观性和盲目性。",
                "老板通：老板通与财务、业务系统整合使用，从财务监控、业务中心、经营分析、业绩考核等方面，提供及时、准确、直观的经营数据及图形，指导企业的经营行为。",
                "产加工：在库存管理中溶入了简单生产管理，支持按订单生产加工、库存生产、按订单设计与按订单装配流程模式的小工业企业，满足以销定产和以产定购、简单领料管理和及时掌握生产加工进度的管理要求。",
            ],
            "image": "./img/t3_5.jpg",
            "main": ""
        },
        {
            "title": "主要功能",
            "name": "T3",
            "content": "",
            "content_ul": [],
            "image": "",
            "main": "系统管理、总账、工资管理、固定资产、供应链管理、财务分析、老板通、产加工等。（以最终购买版本为准）"
        }
    ];

    // 做成单页面，就直接写了
    var shuju2 = [
        {
            "title": "规范流程，提升效益",
            "name": "T6",
            "content": "",
            "content_ul": [
                "为成长型企业提供财务、业务、生产一体化管理，帮助企业规范流程，提升企业运营效益",
                "为企业管理者提供多角度的经营数据分析，帮助管理者洞察企业经营变化，做好决策分析 ",
                "产品支持最新《小企业会计准则》、《企业会计信息化工作规范》",
                "产品全面适应WIN10系统"
            ],
            "image": "./img/t6_1.jpg",
            "main": ""
        },
        {
            "title": "移动看经营",
            "name": "T6",
            "content": "云看板，您贴身的数据分析师 &实时呈现企业经营数据（支持pc端、平板、手机、TV等），提供“盈亏预测“、”销售毛利分析“、”费用分析”，助管理者盯住利润；“资金预测“、”应收款分析“、”库存资金占用分析“、”市场价值分析“、”超期发货分析”帮管理者管好现金",
            "content_ul": [],
            "image": "./img/t6_2.jpg",
            "main": ""
        },
        {
            "title": "订货平台帮您盯生意",
            "name": "T6",
            "content": "",
            "content_ul": [
                "为您的经销商提供专属订货平台，满足企业对经销商管理的需求，帮企业提升订单处理效率",
                "与T6系统完美集成，经销商下达订单后自动同步至T6系统",
                "多种商品展示风格，支持企业经销商24小时自主下单订货"
            ],
            "image": "./img/t6_3.jpg",
            "main": ""
        },
        {
            "title": "流程式管控，过程化管理",
            "name": "T6",
            "content": "对业务各环节实行流程式管控，对核心业务做到事前计划、事中控制、事后分析&通过建立数据信息共享平台，解决企业部门之间数据分散、信息不集成的问题，实现企业内部的过程化管理&支持企业中不同角色人员轻松实现从业务处理到财务核算，再到多维度的报表分析的全过程管理&在帮助企业管理财务、供应链、生产等业务的同时，兼顾企业人力资源、客户关系、协同办公的管理",
            "content_ul": [],
            "image": "./img/t6_4.jpg",
            "main": ""
        },
        {
            "title": "业务流程全管理，关键流程全控制",
            "name": "T6",
            "content": "财务管理：以业务凭证为核心，完成从财务核算到多维度报表分析的全过程管理。&助您实现&资金流向追溯；业务往来核算；收付款计划；成本核算；工资核算与发放；企业资产动态管理；固定资产折旧与处理；财经报表编制；财务决策分析。",
            "content_ul": [],
            "image": "./img/t6_5.jpg",
            "main": ""
        },
        {
            "title": "",
            "name": "T6",
            "content": "",
            "content_ul": [
                "供应链管理：对采购、销售、仓库业务实行全过程管理，规范业务流程。",
                "助您实现：",
                "供应商管理及采购业务全过程跟踪，降低采购成本；",
                "客户管理及销售订单全过程跟踪，降低赊销风险确保及时交货；",
                "优化库存结构，对企业资源进行有效调配，降低库存积压和业务风险；",
                "准确的存货成本核算，有效监督存货资金占用的动态变化。"
            ],
            "image": "./img/t6_6.jpg",
            "main": ""
        },
        {
            "title": "会上网就会用的OA",
            "name": "T6",
            "content": "",
            "content_ul": [
                "T-协同办公管理，帮助企业打造简约、实时、便捷的协同办公平台。帮助企业实现：",
                "图形化工作流程审批",
                "制度执行",
                "企业级知识管理",
                "业务协同管理",
                "手机移动办公"
            ],
            "image": "./img/t6_7.jpg",
            "main": ""
        },
        {
            "title": "",
            "name": "T6",
            "content": "",
            "content_ul": [
                "产品应用特色",
                "与T6-企业管理软件集成应用：统一平台登陆，减少资源浪费；",
                "导航式应用：指引使用者轻松进入网络办公环境，实现协同办公；",
                "实时管理：在任何时候、任何事项都能够快速处理，协同高效；",
                "工作流程图形化：个性化流程随意定，流转更透明；",
                "移动处理：包括新闻、公告、邮件、通讯录查看，流程提醒、查看、审批等；",
                "消息推送：待办消息直接推送至手机消息中心，第一时间提醒；",
                "信息同步：内部通讯录、个人通讯录、日程、计划同步处理，信息及时，快速准确不遗漏；"
            ],
            "image": "./img/t6_8.jpg",
            "main": ""
        },
        {
            "title": "T6 HR 将企业HR解放出来",
            "name": "T6",
            "content": "聚焦于中小企业人力资源管理业务，实现与T6-企业管理软件的紧密集成和数据对接，更好地满足企业对人力资源管理的需求。",
            "content_ul": [],
            "image": "",
            "main": ""
        },
        {
            "title": "",
            "name": "T6",
            "content": "",
            "content_ul": [
                "产品应用特色：",
                "及时了解员工信息，快速甄选优秀人才，加强企业对人力资本的管理；",
                "对人力资源进行重新配置，智能化管理，弥补管理漏洞，以适应不断变化的形势；",
                "人力资源数据分析实现劳动力优化，合理规避用工风险，降低用工成本；",
                "通过培训与绩效考核管理使员工快速适应岗位要求，提升员工整体素质；",
                "集中记录、监测和分析所有劳动力的技能和资格，提供决策分析；",
                "对薪资、考勤、绩效进行全面一体化管理；",
                "提供人力资源事管理常用的报表，也可根据企业实际需要进行自定义报表；",
                "员工及经理角色自助平台，实现企业全员参与到人力资源管理中；"
            ],
            "image": "./img/t6_9.jpg",
            "main": ""
        },
        {
            "title": "主要功能",
            "name": "T6",
            "content": "",
            "content_ul": [],
            "image": "",
            "main": "总账、UFO报表、应收款管理、应付款管理、出纳管理、网上银行、工资管理、固定资产管理、成本管理、财务分析、税务管理、采购管理、销售管理、委外管理、库存管理、存货核算、生产管理等。（以最终购买版本为准）"
        }
    ];

    // u8
    var shuju3 = [
        {
            "title": "用友U8+成长型企业互联网应用平台架构",
            "name": "",
            "content": " ",
            "content_ul": [],
            "image": "./img/u8_1.jpg",
            "main": ""
        },
        {
            "title": "",
            "name": "",
            "content": "用友U8+成长型企业互联网应用平台，为成长型企业提供预配置的管理与业务实践，以企业全面精细化管理方案为核心，融入互联网时代的新兴元素：移动技术、网络营销、电子商务、体验营销，帮助企业实现产业链协同，拓展企业社交化应用，推进企业经营管理模式变革，助力企业基业长青。",
            "content_ul": [],
            "image": "./img/u8_2.jpg",
            "main": ""
        },
        {
            "title": "",
            "name": "",
            "content": " ",
            "content_ul": [],
            "image": "./img/u8_3.jpg",
            "main": ""
        },
        {
            "title": "用友U8+成长型企业十二大互联网应用模式",
            "name": "",
            "content": "用友U8+为成长型企业提供了十二大互联网应用模式，包括营销服务一体化、电子商务、供应链协同、设计制造一体化、精益生产、精细管控、人力资源、办公协同、移动应用、大数据分析、社交化协同和云服务，成长型企业可以按照不同的管理需求，选择合适的模式。",
            "content_ul": [],
            "image": "./img/u8_4.jpg",
            "main": ""
        },
        {
            "title": "U8+企业互联网应用123部署",
            "name": "",
            "content": " ",
            "content_ul": [],
            "image": "./img/u8_5.jpg",
            "main": ""
        },
        {
            "title": "完整覆盖 行业支撑",
            "name": "",
            "content": "我们向您提供覆盖企业各个经营及管理环节，高颗粒度的应用方案及产品。&我们利用二十余年在多个行业的专业实践，向您提供全面的行业解决方案及服务。",
            "content_ul": [],
            "image": "./img/u8_6.gif",
            "main": ""
        },
        {
            "title": "经营平台 多端应用",
            "name": "",
            "content": "U8+支持企业实现商业软件的多端（PC、手机、平板等多种设备）多系统（windows、iOS、Android等主流系统）应用部署，实现跨屏应用，结合多种业务协作场景与业务处理流程，发挥移动设备便携特性及互联网广域优势，全面提升企业对最前端客户的消费行为、销售经理及团队的营销行为和营销通路的商业数据采集效率、关键营销业务的审批与处理效率，对提升企业整体市场竞争力，快速洞察市场变化，提升市场响应速度有巨大帮助。",
            "content_ul": [],
            "image": "./img/u8_7.gif",
            "main": ""
        },
        {
            "title": "灵活部署 按需配置",
            "name": "",
            "content": "支持各类企业全生命周期的经营与管理，包括单体（含多工厂）产业链协作经营，多渠道经营的工业及商贸企业。",
            "content_ul": [],
            "image": "./img/u8_8.gif",
            "main": ""
        },
        {
            "title": "深度价值创造",
            "name": "",
            "content": "用友深耕中国及亚太市场25年，将中国企业的经营智慧及全球先进管理思想和技术内化于U8+产品及方案，&全面满足您在不同的发展阶段的管理诉求，追求实效，快速应用，通过数据驱动实现深度价值创造。",
            "content_ul": [],
            "image": "./img/u8_9.gif",
            "main": ""
        },
        {
            "title": "快速见效 全面提升",
            "name": "",
            "content": "U8+可以为您提供简单适用、快速见效、低成本的实施工具，全面提升实施效能。&该工具可使实施周期降低16%，实施成本得到有效控制。",
            "content_ul": [],
            "image": "./img/u8_11.gif",
            "main": ""
        },
        {
            "title": "遍布亚洲及中国的支持服务",
            "name": "",
            "content": "无论您在哪里，我们都可以为您提供专业、迅捷的服务与支持。",
            "content_ul": [],
            "image": "./img/u8_10.gif",
            "main": ""
        },
    ];


    //模板1
    function moban1(title,name,content,image){
        var content_val = content.split("&").join("<br>");
        var div = '<div class="my_advantage"><div class="my_title"><span>'+title+'</span></div>'+
                '<div class="my_box"><p>'+
                '<span>'+name+'</span>'+
                '<span>'+content_val+'</span> </p>'+
                '<img src="'+image+'" alt="">'+
                '</div></div>'
        return div
    }
    var aaa = moban1("规范流程，提升效率","T3","面向小微企业财务、业务一体化管理的财务软件，帮助企业管好财务、理清业务，方便易用，是财务人员的好帮手。产品支持2013《小企业会计准则》。","./img/t3_1.jpg")
    // console.log(aaa);

    //模板2
    function moban2(title,content_ul,image){
        var ul = "";
        for(var r=0;r<content_ul.length;r++){
            ul += '<li><span>- '+content_ul[r]+'</span></li>';
        }
        var div = '<div class="my_advantage"><div class="my_title"><span>'+title+'</span></div>'+
                '<div class="my_box row">'+
                '<div class="my_left col-md-6 col-sm-6 col-xs-12"><ul>'+ul+'</ul></div>'+
                '<div class="my_right col-md-6 col-sm-6 col-xs-12">'+
                '<img src="'+image+'" alt="">'+
                '</div></div></div>';
        return div
    }

    //模板3
    function moban3(name,main){
        var div = '<div class="my_main">'+
                '<p><span>'+name+'</span><span>主要功能：</span></p>'+
                '<p><span>'+main+'</span></p>'+
                '</div>'
        return div
    }
    
    //填充到页面
    function append(arr){
        var div_box = "";
        for(var j=0;j<arr.length;j++){
            var div = arr[j];
            if(div["main"]==""&&div["content"]!=""){
                //moban1 格式
                div_box += moban1(div["title"],div["name"],div["content"],div["image"]);
            }else if(div["main"]==""&&div["content_ul"]!=""){
                div_box += moban2(div["title"],div["content_ul"],div["image"]);
            }else if(div["main"]!=""){
                div_box += moban3(div["name"],div["main"]);
            }
        }
        $(div_box).appendTo("#my_content");
    }
    // append(shuju1);


    //获取url
    getQueryString = function (name) {
        var   reg   =   new   RegExp("(^|&)"+   name   +"=([^&]*)(&|$)");
        var   r   =   window.location.search.substr(1).match(reg);
        if   (r!=null)   return   unescape(r[2]);   return   "";
    };

    //监听url地址
    var url_id = getQueryString("add");
    console.log(url_id);
    if(url_id == 0){
        append(shuju1);
        $("#top_qie").find("a").eq(url_id).addClass("active");
    }else if(url_id == 1){
        append(shuju2);
        $("#top_qie").find("a").eq(url_id).addClass("active");
    }else if(url_id == 2){
        append(shuju3);
        $("#top_qie").find("a").eq(url_id).addClass("active");
    }else if(url_id == 3){
        append(shuju2);
        $("#top_qie").find("a").eq(url_id).addClass("active");
    }else{
        append(shuju1);
        $("#top_qie").find("a").eq(url_id).addClass("active");
    }
});